team-ruby/app/controllers/team_tasks_controller.rb

SELECT "team_tasks".* FROM "team_tasks"
---
  def index
    @team_tasks = TeamTask.all

INSERT INTO "team_tasks" ("title", "description", "status", "assigned_to", "due_date", "created_at", "updated_at") VALUES ('Criar documentação do Projeto', 'Escrever e detalhar todas as etapas de construção do projeto da Softex', 'Entregue', 'Luiz Gustavo', NULL, '2025-07-20 01:02:25.589417', '2025-07-20 01:02:25.589417') RETURNING "id"
---
    task = TeamTask.new(team_task_params)

    if task.save

UPDATE "team_tasks" SET "due_date" = '2025-07-20', "updated_at" = '2025-07-20 01:04:42.398029' WHERE "team_tasks"."id" = 1
---
  def update
    if @team_task.update(team_task_params)

DELETE FROM "team_tasks" WHERE "team_tasks"."id" = 6
---
  def destroy
    if @team_task.destroy

SELECT "team_tasks".* FROM "team_tasks" WHERE "team_tasks"."id" = 5 LIMIT 1
---
    def set_team_task
      @team_task = TeamTask.find(params.expect(:id))